product = {'เหรียญทอง':{'คะแนน':100,'สี':'ทอง'},
           'เหรียญเงิน':{'คะแนน':50,'สี':'เงิน'},
           'เหรียญทองแดง':{'คะแนน':20,'สี':'ทองแดง'}}
    


while True:
    print('----กรุณากรอกข้อมูลชนิดของเหรียญที่ได้รับ----')
    p = input('เหรียญที่ได้รับ: ')
    q = int(input('จำนวน: '))
    print('-----')
    if p in product:
        print(f'เหรียญ: {p} คะแนน: {product[p]['คะแนน']} สี: {product[p]['สี']}')
        print(f'เหรียญ: {q} ชิ้น รวมทั้งหมด: {product[p]['คะแนน'] * q} คะแนน')
    else:
        print('ไม่มีเหรียญชนิดนี้ในระบบ')
    # ออกจากลูปโดยการกด ctrl+c (ตอนที่รันแล้ว)